+ 2-Систем нь хамгийн их ном уншсан үйлчлүүлэгчийг тооцоолж Админаар орохоор одоогийн байдлаар хамгийн их ном уншсан үйлчлүүлэгч болон хамгийн их уншигдсан номыг харуулдаг болгох.
3- Нэвтэрсэн үйлчлүүлэгч ном оруулахдаа шууд upload гээд оруулдагийг нь болиулаад ном оруулах хүсэлт явуулаад админаар батлуулдаг болгох.
+ 4- Нэвтэрсэн үйлчлүүлэгч ном оруулахдаа категори нэмдэг эрхийг нь болиулаад байгаа категороос нь сонгож нэмдэг болгох
+ Hi бас нэвтрээгүй үйлчлүүлэгч нь номын файлд хандах боломжгүй болгох. Өөрөөр хэлбэл заавал нэвтэрч байж номын файлд хандах боломжтой болгох.